#+TITLE: lpaggregR
#+AUTHOR: Lucas Mello Schnorr
#+STARTUP: overview indent
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

** List cases in Zenodo URL
:PROPERTIES:
:header-args: :tangle read-starvz-export-pjdump-lpaggreg.R :tangle-mode (identity #o755) :shebang "#!/usr/bin/Rscript"
:END:

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
cases.list <- c(
	"traces/exageo"#,
#	"traces/chameleon_exps/chameleon_simu_vis_2W+DIF__96000__30",
#	"traces/chameleon_exps/chameleon_simu_vis_COMMG__96000__30",
#	"traces/chameleon_exps/chameleon_simu_vis_COMM1N__96000__30",
#	"traces/chameleon_exps/chameleon_simu_vis_N2GPUL__96000__30",
#	"traces/chameleon_exps/chameleon_simu_vis_BASE__96000__30"
  )
cases.list
#+end_src

#+RESULTS:
: [1] "traces/exageo"

* Testing previous functions


#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
ELEMENT <- "traces/exageo"
TRACE.signature <- basename(ELEMENT)
TRACE.dir <- dirname(ELEMENT)
TRACE.pjdump <- paste0(TRACE.signature, ".pjdump")
TRACE.pdf <-  paste0(TRACE.signature, ".pdf")
pdf(file=TRACE.pdf)    
p <- read_starvz_export_pjdump(TRACE.dir, TRACE.signature)
print(p)
#p <- lpaggreg_utilization(TRACE.pjdump)
#print(p)
#dev.off()
#+end_src

#+RESULTS:
| x |
|---|
| 1 |

#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
th=0.0001
trace <- parsepjdump(TRACE.pjdump)
micro <- pjdump2micro(trace, 100,"State",FALSE)
odf <- oaggregate(micro$data, th)
q.plot <- qualplot(odf)
#+end_src

#+RESULTS:
|---|

#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
hdf<-haggregate(micro$data, micro$hierarchy, th)
#+end_src

#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
q.plot
#+end_src

#+RESULTS:
|---|

** Read

Container, Parent, Type, Start, End, Duration, Name

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
library(tidyverse)
library(starvz)
TRACE.signature <- "exageo"
TRACE.base <- "traces"
TRACE.dir <- paste0(TRACE.base, "/", TRACE.signature)
TRACE.pjdump <- paste0(TRACE.signature, ".pjdump")
options(crayon.enabled=FALSE)
library(tidyverse)
library(starvz)
df <- starvz_read(TRACE.dir)
df$Application |>
  select(Node, Resource, ResourceId, ResourceType) |>
  mutate(Node = paste0("n", Node)) |>
  distinct() |>  
  arrange(Node, ResourceType) -> df.hierarchy
df$Application |>
  select(Start, End) |>
  summarize(Start = min(Start), End = max(End)) -> df.times
my.start <- df.times$Start
my.end <- df.times$End
my.duration <- my.end - my.start
#+end_src

#+RESULTS:
: Error in library(starvz) : there is no package called ‘starvz’
: Error in library(starvz) : there is no package called ‘starvz’
: Error in starvz_read(TRACE.dir) : could not find function "starvz_read"
: Error in df$Application : object of type 'closure' is not subsettable
: Error in df$Application : object of type 'closure' is not subsettable
: Error: object 'df.times' not found
: Error: object 'df.times' not found
: Error: object 'my.end' not found

** Level-1 (Node)

#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
df.hierarchy |>
  select(Node) |>
  distinct() |>
  mutate(Container = "Container",
         Parent = "root",
         Type = "NODE",
         Start = my.start,
         End = my.end,
         Duration = my.duration,
         Name = Node) |>
  select(Container, Parent, Type, Start, End, Duration, Name) |>
  write_csv(TRACE.pjdump, append=TRUE)
#+end_src

#+RESULTS:
| Container | Parent | Type |         Start |          End |     Duration | Name |
|-----------+--------+------+---------------+--------------+--------------+------|
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n0   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n1   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n2   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n3   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n4   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n5   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n6   |
| Container | root   | NODE | -15794.803421 | 59835.191056 | 75629.994477 | n7   |

** Level-2 (Resource Type)

#+begin_src R :results table :session *R* :exports both :noweb yes :colnames yes
df.hierarchy |>
  select(Node, ResourceType) |>
  distinct() |>  
  mutate(RT = paste(Node, ResourceType, sep="-")) |>
  mutate(Container = "Container",
         Parent = Node,
         Type = "RT",
         Start = my.start,
         End = my.end,
         Duration = my.duration,
         Name = RT) |>
  select(Container, Parent, Type, Start, End, Duration, Name) |>  
  write_csv(TRACE.pjdump, append=TRUE)
#+end_src

#+RESULTS:
| Container | Parent | Type |         Start |          End |     Duration | Name     |
|-----------+--------+------+---------------+--------------+--------------+----------|
| Container | n0     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n0-CPU   |
| Container | n1     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n1-CPU   |
| Container | n2     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n2-CPU   |
| Container | n3     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n3-CPU   |
| Container | n4     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n4-CPU   |
| Container | n5     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n5-CPU   |
| Container | n6     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n6-CPU   |
| Container | n6     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n6-CUDA_ |
| Container | n7     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n7-CPU   |
| Container | n7     | RT   | -15794.803421 | 59835.191056 | 75629.994477 | n7-CUDA_ |

